app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs"
---
  def index
    if Artist.find_by(id: params[:artist_id])
      @songs = Artist.find_by(id: params[:artist_id]).songs
    elsif params[:artist_id]
      flash[:alert] = "Artist not found."
      redirect_to artists_path
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def show
    if @song = Song.find_by(id: params[:id])
    else
      flash[:alert] = "Song not found."
      redirect_to artist_songs_path(Artist.find_by(id: params[:artist_id]))